# Απλή επιλογή

age = int(input("Δώσε την ηλικία του πολίτη: "))

if age in range(0, 18):
    print("Ο πολίτης δεν μπορεί να ψηφίσει.")

if age in range(18, 71):
    print("Ο πολίτης υποχρεούται να ψηφίσει.")

if age in range(71, 150):
    print("Ο πολίτης δεν υποχρεούται να ψηφίσει.")

# Σύνθετη επιλογή

age_s = int(input("Δώσε την ηλικία του πολίτη: "))

if age_s in range(0, 18):
    print("Ο πολίτης δεν μπορεί να ψηφίσει.")
else:
    if age_s in range(18, 71):
        print("Ο πολίτης υποχρεούται να ψηφίσει.")
    else:
        print("Ο πολίτης δεν υποχρεούται να ψηφίσει.")


# Πολλαπλή επιλογή

age_p = int(input("Δώσε την ηλικία του πολίτη: "))

if age_p in range(0, 18):
    print("Ο πολίτης δεν μπορεί να ψηφίσει.")
elif age_p in range(18, 71):
    print("Ο πολίτης υποχρεούται να ψηφίσει.")
else:
    print("Ο πολίτης δεν υποχρεούται να ψηφίσει.")
